In [68]:
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
from collections import OrderedDict

In [69]:
csv1 = pd.read_csv('/output/dataset/BX-Book-Ratings.csv',error_bad_lines=False, encoding='ISO-8859-1', sep=";" )
csv2 = pd.read_csv('/output/dataset/BX-Books.csv',error_bad_lines=False, encoding='ISO-8859-1', sep=";" )
csv3 = pd.read_csv('/output/dataset/BX-Users.csv',error_bad_lines=False, encoding='ISO-8859-1', sep=";" )

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
/usr/local/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2698: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [70]:
print(csv1.columns)
print(csv2.columns)
print(csv3.columns)

Index(['User-ID', 'ISBN', 'Book-Rating'], dtype='object')
Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')
Index(['User-ID', 'Location', 'Age'], dtype='object')

In [71]:
print(csv1.shape)
print(csv2.shape)
print(csv3.shape)

(1149780, 3)
(271360, 8)
(278858, 3)

In [72]:
csv1.head()
# csv2.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [73]:
csv3.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [74]:
df1=pd.merge(csv1,csv2)

In [75]:
df2=pd.merge(csv1,csv3)

In [76]:
df=pd.merge(df1, df2)

In [77]:
df.head()

,User-ID,ISBN,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L,Location,Age
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"tyler, texas, usa",NaN
1,2313,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"cincinnati, ohio, usa",23.0
2,6543,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"strafford, missouri, usa",34.0
3,8680,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"st. charles county, missouri, usa",2.0
4,10314,034545104X,9,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"beaverton, oregon, usa",NaN

In [78]:
df.columns

Index(['User-ID', 'ISBN', 'Book-Rating', 'Book-Title', 'Book-Author',
       'Year-Of-Publication', 'Publisher', 'Image-URL-S', 'Image-URL-M',
       'Image-URL-L', 'Location', 'Age'],
      dtype='object')

In [79]:
np.unique(df["Book-Title"],)[0]

' A Light in the Storm: The Civil War Diary of Amelia Martin, Fenwick Island, Delaware, 1861 (Dear America)'

In [80]:
df.head()

,User-ID,ISBN,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L,Location,Age
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"tyler, texas, usa",NaN
1,2313,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"cincinnati, ohio, usa",23.0
2,6543,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"strafford, missouri, usa",34.0
3,8680,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"st. charles county, missouri, usa",2.0
4,10314,034545104X,9,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,http://images.amazon.com/images/P/034545104X.0...,"beaverton, oregon, usa",NaN

In [81]:
df =df.drop([ 'ISBN', 'Image-URL-S', 'Image-URL-M',
       'Image-URL-L', 'Publisher',],axis=1)

In [82]:
df=df.sort_values(['Book-Title'])

In [83]:
df.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Location,Age
575119,96448,9,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"albuquerque, new mexico, usa",NaN
575118,55927,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"roscoe, minnesota, usa",17.0
575117,35859,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"duluth, minnesota, usa",NaN
575116,18995,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"atlanta, georgia, usa",NaN
954578,172742,0,Always Have Popsicles,Rebecca Harvin,1994,"astoria, oregon, usa",44.0

In [84]:
df.reset_index(drop=True, inplace=True)

In [85]:
df.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Location,Age
0,96448,9,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"albuquerque, new mexico, usa",NaN
1,55927,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"roscoe, minnesota, usa",17.0
2,35859,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"duluth, minnesota, usa",NaN
3,18995,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"atlanta, georgia, usa",NaN
4,172742,0,Always Have Popsicles,Rebecca Harvin,1994,"astoria, oregon, usa",44.0

### nanmean

In [86]:
df['Age']=df['Age'].fillna(np.nanmean(df.Age)).astype("int64")

In [87]:
df.Age.dtype

dtype('int64')

In [90]:
df.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Location,Age
0,96448,9,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"albuquerque, new mexico, usa",37
1,55927,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"roscoe, minnesota, usa",17
2,35859,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"duluth, minnesota, usa",37
3,18995,0,A Light in the Storm: The Civil War Diary of ...,Karen Hesse,1999,"atlanta, georgia, usa",37
4,172742,0,Always Have Popsicles,Rebecca Harvin,1994,"astoria, oregon, usa",44

In [91]:
 from sklearn.preprocessing import LabelEncoder

In [92]:
le=LabelEncoder()

In [93]:
df['Book-Title']=pd.DataFrame(le.fit(df['Book-Title']).transform(sorted(list((df['Book-Title'])))))

In [94]:
df['Location']=pd.DataFrame(le.fit(df['Location']).transform(sorted(list((df['Location'])))))

In [95]:
df['Book-Author']=pd.DataFrame(le.fit(df['Book-Author']).transform(sorted(list((df['Book-Author'])))))

In [96]:
np.unique(df["Location"],return_counts=True)

(array([    0,     1,     2, ..., 22477, 22478, 22479]),
 array([1, 1, 1, ..., 1, 4, 1]))

In [97]:
df.head()

,User-ID,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Location,Age
0,96448,9,0,0,1999,0,37
1,55927,0,0,0,1999,1,17
2,35859,0,0,0,1999,2,37
3,18995,0,0,0,1999,3,37
4,172742,0,1,1,1994,4,44

### processing of year of publ

In [98]:
df["Year-Of-Publication"]=(df["Year-Of-Publication"].astype("str"))

In [99]:
df=df[df['Year-Of-Publication'].map(len)==4]

In [100]:
df["Year-Of-Publication"].astype("int64")

0          1999
1          1999
2          1999
3          1999
4          1994
5          1984
6          2001
7          1989
8          2000
9          2004
10         1994
11         1994
12         1991
13         1991
14         1991
15         1991
16         1991
17         1991
18         1991
19         1991
20         1991
21         1991
22         1999
23         1999
24         1999
25         1999
26         2002
27         2002
28         1996
29         1996
           ...
1031106    1996
1031107    1996
1031108    1996
1031109    1974
1031110    1994
1031111    2000
1031112    2000
1031113    1995
1031114    2002
1031115    2001
1031116    1994
1031117    2001
1031118    2001
1031119    1997
1031120    1998
1031121    2000
1031122    2000
1031123    1995
1031124    2002
1031125    2002
1031126    1987
1031127    1987
1031128    1987
1031129    1987
1031130    2001
1031131    2000
1031132    2000
1031133    2000
1031134    1998
1031135    1998
Name: Year-Of-Publication, Length: 1017123, dtype: int64

In [101]:
df.to_csv("Processed_Dataset.csv",index = False, encoding="utf-8")